In [1]:
import pandas as pd

In [3]:
frame = pd.read_csv('data.tsv', sep='\t', header=0)

In [4]:
frame.head(3)

           Name       Birth       City  Position
0   Иванов А.А.  22.03.1980     Москва       NaN
1  Сорокин И.В.  07.08.1965  Волгоград   инженер
2    Белов М.М.  13.02.1980     Ростов  менеджер

In [6]:
frame[-3::]

              Name       Birth    City Position
3  Мельникова Д.С.  15.04.1985  Ростов      NaN
4      Рыбина Е.П.  19.11.1985  Москва  инженер
5     Костров С.О.  31.05.1985  Москва   стажер

In [9]:
frame[0::2]

          Name       Birth    City  Position
0  Иванов А.А.  22.03.1980  Москва       NaN
2   Белов М.М.  13.02.1980  Ростов  менеджер
4  Рыбина Е.П.  19.11.1985  Москва   инженер

In [10]:
frame.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

In [11]:
frame.info

<bound method DataFrame.info of               Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер>

In [13]:
frame.Name

0        Иванов А.А.
1       Сорокин И.В.
2         Белов М.М.
3    Мельникова Д.С.
4        Рыбина Е.П.
5       Костров С.О.
Name: Name, dtype: object

In [14]:
frame.Birth = frame.Birth.apply(pd.to_datetime)

In [15]:
frame.Birth

0   1980-03-22
1   1965-07-08
2   1980-02-13
3   1985-04-15
4   1985-11-19
5   1985-05-31
Name: Birth, dtype: datetime64[ns]

In [16]:
frame

              Name      Birth       City  Position
0      Иванов А.А. 1980-03-22     Москва       NaN
1     Сорокин И.В. 1965-07-08  Волгоград   инженер
2       Белов М.М. 1980-02-13     Ростов  менеджер
3  Мельникова Д.С. 1985-04-15     Ростов       NaN
4      Рыбина Е.П. 1985-11-19     Москва   инженер
5     Костров С.О. 1985-05-31     Москва    стажер

In [17]:
frame.fillna('разнорабочий', inplace=True)

In [18]:
frame

              Name      Birth       City      Position
0      Иванов А.А. 1980-03-22     Москва  разнорабочий
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер

In [24]:
frame.ix[[1,3,5], ['Name', 'City']]

C:\Users\777\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [25]:
frame[(frame.Birth >= pd.datetime(1985, 1, 1)) | (frame.City == 'Волгоград')]

              Name      Birth       City      Position
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер

In [27]:
frame.shape

(6, 4)